package internal

// /internal
// Сердце нашего приложения — всю внутреннюю логику
// приложения храним здесь. /internal не импортируем в других
// приложениях и библиотеках. Код, который написан тут,
// предназначен исключительно для внутреннего использования в
// рамках кодовой базы. С версии Go 1.4 определен механизм,
// который не позволяет импортировать пакеты вне данного
// проекта, если они находятся внутри /internal.

// В /internal мы храним бизнес-логику проекта и работу с базами
// данными. В общем, всю логику, связанную с этим приложением.
// Выстроить структуру внутри /internal можно по-разному, в
// зависимости от архитектуры. Но я не буду сильно углубляться в
// нее, а поверхностно покажу, как это выглядит. Приведу пример
// трехуровневой архитектуры, когда приложение делится на 3 слоя:

// Транспортный.
// Сетевой уровень приложения, на котором конечный пользователь взаимодействует с приложением.
// После обработки запроса вся собранная информация идет на слой ниже.

// Бизнес.
// Как следует из названия, содержит бизнес-логику,
// которая поддерживает основные функции приложения. Если в логике затрагиваются базы данных, мы идем на слой ниже.

// Базы данных.
// Отвечает за взаимодействие с постоянными хранилищами,
// такими как базы данных, и прочую обработку информации,
// которая не связана с бизнесом. Например, чтение и запись в базе данных.

// Логика должна быть выстроена так, чтобы слои иерархически
// обращались друг к другу сверху вниз и наоборот. Не допускается,
// чтобы один слой перескакивал через промежуточный (например,
// транспортный напрямую в базу данных) и нижний не общался с
// верхним (например, база данных ходит в транспортный слой).

// /app
// Точка, где все наши зависимости и логика собираются и запускают приложение. Run-метод, который вызывается из /cmd.

// /config
// Инициализация общих конфигураций приложения, которые мы прописывали в корне проекта.

// /database (слой базы данных)
// Файлы содержат методы для взаимодействия с базами данных.

// /models (слой базы данных)
// Структуры таблиц баз данных.

// /services (бизнес-слой)
// Вся бизнес-логика приложения.

// /transport (транспортный слой)
// Здесь храним http-настройки сервера, хендлеры, порты и так далее.
